a1 = 7
a2 = 10
a3 = 4
N = int(input('Введіть значення N:  '))
y1 = N/a1
y2 = N/a2
y3 = N/a3
if N == 1 and N == 1 and N == 1:
    print('це спільне кратне для всіх чисел')
elif N == 1 and N == 1:
    print('це спільне кратне тільки для а1 та а2')
elif N == 1 and N == 1:
    print("це спільне кратне тільки для а1 та а3")
elif N == 1 and N == 1:
    print("це спільне кратне тільки для а2 та а3")
elif N == 1:
    print("це спільне кратне тільки для а1")
elif N == 1:
    print("це спільне кратне тільки для а2")
elif N == 1:
    print("це спільне кратне тільки для а3")
else:
    print('це не є спільне кратне для жодного числа')